// Array คือ แถวลำดับ เป็นโครงสร้างข้อมูล
//แถวลำดับในที่นี้เปรียบเสมือนมีช่องหลายๆช่องเรียงติดกัน
//เราจะใช้Arrayกับการเขียนโปรแกรมในเรื่องของตัวแปร ก็จะเกิดสิ่งที่เรียกว่า ตัวแปรArray

#include <stdio.h>

void main(){
    //ตัวแปรปกติ (1 ตัว เปรียบเสมือนช่อง 1 ช่อง เก็บได้ 1 ข้อมูล แต่ข้อมูลในช่องสามารถเปลี่ยนแปลงได้ตลอด)
    int dataA;
    double dataB = 30;

    //ตัวแปรArray (1 ตัว มีช่องหลายช่อง เก็บได้หลายข้อมูล ข้อมูลในแต่ละช่องเปลี่ยนแปลงได้ตลอด) 
    int dataC[5];
    double dataD[] = {10, 20, 30, 40, 50};

    dataA = 111;
    dataB = 222;
    printf("Data A is %d\n", dataA);
    printf("Data B is %lf\n", dataB);
    printf("----------\n");

    dataC[2] = 500;
    dataC[0] = 100;
    printf("data C [2] is %d\n", dataC[2]);
    printf("data D [5] is %lf\n", dataD[4]);

}